CSI API ETABS v1

# cCombo Interface

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    public interface cCombo

    Public Interface cCombo

    Dim instance As cCombo

    public interface class cCombo

    type cCombo =  interface end

The cCombo type exposes the following members.

Methods

| Name| Description
---|---|---
|
Add|  Adds a new load combination.
|
AddDesignDefaultCombos|
|
Delete|  Deletes the specified
load combination.
|
DeleteCase|  Deletes one load case
or load combination from the list of cases included in the specified load
combination.
|
GetCaseList|  Retrieves all load
cases and response combinations included in the load combination specified by
the Name item.
|
GetCaseList_1|  Retrieves all load
cases and response combinations included in the load combination specified by
the Name item.
|
GetNameList|  Retrieves the names
of all defined response combinations.
|
GetTypeCombo|  Retrieves the
combination type for specified load combination.
|
GetTypeOAPI|
|
SetCaseList|  Adds or modifies one
load case or response combination in the list of cases included in the load
combination specified by the Name item.
| [SetCaseList_1](d8916b66-1705-c8be-
bcdf-ef1104d4a959.htm)|  Adds or modifies one load case or response
combination in the list of cases included in the load combination specified by
the Name item.
Top

See Also

#### Reference

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com